# Session 17

## Task 4

**How to add data on an existing csv file , excel file same sheet**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('x.csv')

In [3]:
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [4]:
new_row = pd.DataFrame({
    "city": ["Egypt"],
    "temperature": [32],
    "humidity": [55]
})

In [5]:
new_row

    city  temperature  humidity
0  Egypt           32        55

In [9]:
new_row.to_csv('x.csv', mode='a', header=False, index=False)

In [11]:
new_df = pd.read_csv('x.csv')

In [12]:
new_df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75
6     Egypt           32        55